000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПараметрыСоединения/ПараметрыСоединения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыСоединения</name>
  <comment>Використовується в різних підключеннях, у тому числі і методом ADO</comment>
  <resources>
    <name>Port</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>public_key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>private_key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Регистрировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>EnumRef.ВнешниеИсточники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>BaseName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВнешниеИсточники/ВнешниеИсточники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВнешниеИсточники</name>
  <enumValues>
    <name>Navision</name>
  </enumValues>
  <enumValues>
    <name>Oracle</name>
  </enumValues>
  <enumValues>
    <name>TerminalDataCollection</name>
  </enumValues>
  <enumValues>
    <name>CountersMotion</name>
  </enumValues>
  <enumValues>
    <name>Табелирование</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочта</name>
  </enumValues>
  <enumValues>
    <name>LiqPay</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменНПСлужебный/Module.bsl
Функция ПолучитьТочкуВхода() Экспорт

	WSURLВебСервиса = "https://api.novaposhta.ua/v2.0/xml/";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыСоединения.ServerAddress
		|ИЗ
		|	РегистрСведений.ПараметрыСоединения КАК ПараметрыСоединения
		|ГДЕ
		|	ПараметрыСоединения.Источник = ЗНАЧЕНИЕ(Перечисление.ВнешниеИсточники.НоваяПочта)
		|	И ПараметрыСоединения.Активен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ServerAddress) Тогда
			WSURLВебСервиса = Выборка.ServerAddress;
		КонецЕсли;
	КонецЦикла;
	
	Возврат  WSURLВебСервиса;
	
КонецФункции


Функция ПолучитьКлючAPI() Экспорт
	
	APIКлюч = "435007549e68681182bb3ab1d15b1690";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыСоединения.Токен
		|ИЗ
		|	РегистрСведений.ПараметрыСоединения КАК ПараметрыСоединения
		|ГДЕ
		|	ПараметрыСоединения.Источник = ЗНАЧЕНИЕ(Перечисление.ВнешниеИсточники.НоваяПочта)
		|	И ПараметрыСоединения.Активен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Токен) Тогда
			APIКлюч = ВыборкаДетальныеЗаписи.Токен;
		КонецЕсли;
	КонецЦикла;

	Возврат  APIКлюч;
	
КонецФункции
